In [1]:
import pandas as pd

In [2]:
import numpy as np

In [13]:
dict={"name":["abc","dbd","dsds","ds"],
     "age":[23,32,43,41]}

In [14]:
df=pd.DataFrame(dict)

In [15]:
df

   age  name
0   23   abc
1   32   dbd
2   43  dsds
3   41    ds

In [16]:
a=df.reindex(index=[1,2,3,4,5,6])

In [17]:
a

    age  name
1  32.0   dbd
2  43.0  dsds
3  41.0    ds
4   NaN   NaN
5   NaN   NaN
6   NaN   NaN

In [18]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 1 to 6
Data columns (total 2 columns):
age     3 non-null float64
name    3 non-null object
dtypes: float64(1), object(1)
memory usage: 144.0+ bytes

In [12]:
a.isnull()

     age   name
1  False  False
2  False  False
3  False  False
4   True   True
5   True   True
6   True   True

In [19]:
a.mean()

age    38.666667
dtype: float64

In [20]:
fd=a.fillna(a.mean(0))

In [21]:
fd

         age  name
1  32.000000   dbd
2  43.000000  dsds
3  41.000000    ds
4  38.666667   NaN
5  38.666667   NaN
6  38.666667   NaN

In [24]:
fd.replace(41,np.nan)

         age  name
1  32.000000   dbd
2  43.000000  dsds
3        NaN    ds
4  38.666667   NaN
5  38.666667   NaN
6  38.666667   NaN

In [26]:
s=a.fillna(a.mode())